---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalResistance
source: html/188de9a2-bd81-70b8-ff37-ca6b6a573da3.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.ThermalResistance Property

The thermal resistance value (R-value) of the construction.

## Syntax (C#)
```csharp
public double ThermalResistance { get; }
```